/*  conquering-codeforces
 *  day 25. #479A
 *
 *  Задача: Петя учится в школе и очень любит математику. Уже несколько занятий они с классом проходят арифметические
 *          выражения. На последнем уроке учительница написала на доске три положительных целых числа a, b, c.
 *          Задание заключалось в том, чтобы расставить между этими числами знаки операций '+' и '*', а также, возможно,
 *          скобки. Значение получившегося выражения должно быть как можно больше. Обратите внимание на то, что знаки
 *          операций можно вставлять только между a и b, а также между b и c, то есть нельзя менять числа местами. Так,
 *          в приведенном примере нельзя получить выражение (1+3)*2.
 *          Ваша задача — по заданным a, b и c вывести, какое максимальное значение выражения можно получить.
 *  Входные данные: Во входных данных записаны три целых числа a, b и c, каждое в отдельной строке (1 ≤ a, b, c ≤ 10).
 *  Выходные данные: Выведите максимальное значение выражения, которое можно получить.
 */

import java.util.Scanner;

public class CF479A
{
    public static void main(String[] args)
    {
        Scanner scanner = new Scanner(System.in);

        int a = Integer.parseInt(scanner.nextLine());
        int b = Integer.parseInt(scanner.nextLine());
        int c = Integer.parseInt(scanner.nextLine());

    }
}
