/*  conquering-codeforces
 *  day 36. #61A
 *
 *  Задача: Шапур решил провести соревнование, в котором мог участвовать любой. На соревновании он раздал участникам
 *          много разных пар чисел. Каждое число состояло из цифр 0 и 1. Участник в соответствие с данной ему парой
 *          чисел должен получить третье. Правило простое: i-ая цифра ответа равна 1 тогда и только тогда, когда i-ые
 *          цифры двух данных чисел отличаются. Иначе i-ая цифра ответа — 0. Шапур подготовил много чисел и сначала
 *          решил проверить собственную скорость. Он понял, что может выполнять эти операции для чисел длины ∞ в
 *          мгновенье ока (длина числа — это количество цифр в нем)! Шапур всегда вычисляет абсолютно верно, и от
 *          участников своего соревнования ждет того же. Он честный человек, поэтому никогда не даст никому слишком
 *          большие числа, и он всегда дает одному человеку числа одинаковой длины.
 *          Сейчас вы примете участие в соревновании Шапура. Посмотрим, кто быстрее!
 *  Входные данные: Входные данные состоят из двух строк. В каждой содержится одно число. Гарантируется, что числа
 *                  состоят только из цифр 0 и 1 и имеют одинаковую длину. Числа могут начинаться с 0.
 *                  Длина чисел не превосходит 100.
 *  Выходные данные: Выведите соответствующий ответ. Обязательно выводите лидирующие нули.
 */

public class CF61A
{
    public static void main(String[] args)
    {

    }
}
