/*  conquering-codeforces
 *  day 35. #82A
 *
 *  Задача: Шелдон, Леонард, Пенни, Раджеш и Говард стоят в очереди к автомату по продаже баночек с напитком
 *          «Double Cola», других людей в очереди нет. Первый в очереди (Шелдон) покупает баночку, выпивает ее
 *          содержимое и раздваивается! Получившиеся два Шелдона встают в конец очереди. Затем следующий в очереди
 *          (Леонард) покупает баночку, выпивает и встает в конец очереди в двойном экземпляре, и так далее. Этот
 *          процесс продолжается до бесконечности. Например, третью баночку колы выпьет Пенни, и очередь будет
 *          выглядеть так: Раджеш, Говард, Шелдон, Шелдон, Леонард, Леонард, Пенни, Пенни.
 *          Напишите программу, которая выведет имя человека, выпившего n-ую баночку.
 *  Входные данные: Входные данные состоят из единственного целого числа n (1 ≤ n ≤ 10^9).
 *  Выходные данные: Выведите единственную строку — имя человека, который выпьет n-ую баночку колы.
 *                   Баночки нумеруются от 1. Обратите внимание, что следует выводить имена в следующем написании:
 *                   "Sheldon", "Leonard", "Penny", "Rajesh", "Howard" (без кавычек). Именно в этом порядке друзья
 *                   стоят в очереди изначально.
 */

public class CF82A
{
    public static void main(String[] args)
    {
        
    }
}
