/*  conquering-codeforces
 *  day 53. #584A
 *
 *  Задача: Олеся любит числа длины n, а Родиону нравятся только числа, делящиеся на t. Найдите какое-нибудь число,
 *          устраивающее их обоих. Ваша задача — по заданным n и t вывести целое число строго больше нуля, состоящие
 *          из n цифр, которое делится на t. Если же такого числа не существует, выведите  - 1.
 *  Входные данные: В единственной строке записаны два числа n и t (1 ≤ n ≤ 100, 2 ≤ t ≤ 10) — длина числа и на что
 *                  оно должно делиться.
 *  Выходные данные: Выведите одно целое положительное число без ведущих нулей, являющееся ответом на задачу, или
 *                   - 1, если такого числа не существует. Если возможных ответов несколько, разрешается вывести любой.
 */

#include <iostream>

int main()
{
    int n, t;
    std::cin >> n >> t;

    return 0;
}
