/*  conquering-codeforces
 *  day 21. #266B
 *
 *  Задача: На перемене в школьной столовой образовалась очередь из n человек, в которой стоят мальчики и девочки.
 *          Изначально ребята встали в таком порядке, в котором они забежали в столовую. Однако через некоторое время
 *          мальчикам стало неловко, что они стоят в очереди перед девочками, и они стали каждую секунду пропускать
 *          девочек вперед. Опишем процесс более точно. Пусть позиции в очереди последовательно пронумерованы целыми
 *          числами от 1 до n, причем тот, кто стоит на позиции номер 1 обслуживается первым. Тогда, если в момент
 *          времени x на i-ой позиции стоит мальчик, а на (i + 1)-ой — девочка, то в момент времени x + 1 на i-ой
 *          позиции будет находиться девочка, а на (i + 1)-ой — мальчик. Моменты времени заданы в секундах.
 *          Вам задано расположение в начальный момент времени, определите, как будет выглядеть очередь через t секунд.
 *  Входные данные: В первой строке заданы два целых числа n и t (1 ≤ n, t ≤ 50), обозначающие количество ребят в
 *                  очереди и время, спустя которое требуется определить, как будет выглядеть очередь.
 *  Выходные данные: Выведите строку a, обозначающую расположение ребят в очереди спустя t секунд.
 */

public class CF266B
{
    public static void main(String[] args) {
	
    }
}
